#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Security checks 🛡️`failure`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/static-website/static-website/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/static-website/static-website

To view this run in a browser, visit:
https://app.terraform.io/app/tiredanimal/static-website/runs/run-XihVgwU6bhxrqknF

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws.cloudflare_record.this: Refreshing state... [id=0af6f421e5473d38e62771f214173f11]
module.azure.cloudflare_record.this: Refreshing state... [id=dddb9e3db2611dc439e893519f9240c4]
module.aws.data.aws_iam_policy_document.this: Refreshing state... [id=342954596]
module.aws.aws_s3_bucket.this: Refreshing state... [id=static.aws.prod.tiredanimal.com]
module.azure.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/f2d2b7c5-7713-41a0-91f3-94f59166e60e/resourceGroups/static]
module.azure.azurerm_storage_account.this: Refreshing state... [id=/subscriptions/f2d2b7c5-7713-41a0-91f3-94f59166e60e/resourceGroups/static/providers/Microsoft.Storage/storageAccounts/tiredanimalprodstatic]
module.azure.azurerm_storage_blob.this["images/background.jpg"]: Refreshing state... [id=https://tiredanimalprodstatic.blob.core.windows.net/$web/images/background.jpg]
module.azure.azurerm_storage_blob.this["index.html"]: Refreshing state... [id=https://tiredanimalprodstatic.blob.core.windows.net/$web/index.html]
module.aws.aws_s3_bucket_object.this["images/background.jpg"]: Refreshing state... [id=images/background.jpg]
module.aws.aws_s3_bucket_object.this["index.html"]: Refreshing state... [id=index.html]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure.azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "static"
    }

  # module.azure.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = false
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "uksouth"
      + min_tls_version                  = "TLS1_0"
      + name                             = "tiredanimalprodstatic"
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "static"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + custom_domain {
          + name          = "static.azure.prod.tiredanimal.com"
          + use_subdomain = false
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + static_website {
          + index_document = "index.html"
        }
    }

  # module.azure.azurerm_storage_blob.this["images/background.jpg"] will be created
  + resource "azurerm_storage_blob" "this" {
      + access_tier            = (known after apply)
      + content_md5            = "ad7a0bc5c87aa2499c5681da58a7fc94"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "images/background.jpg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "../src/images/background.jpg"
      + storage_account_name   = "tiredanimalprodstatic"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.azure.azurerm_storage_blob.this["index.html"] will be created
  + resource "azurerm_storage_blob" "this" {
      + access_tier            = (known after apply)
      + content_md5            = "fa12d8e6569e901fbe6ca8997fa973ae"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "index.html"
      + parallelism            = 8
      + size                   = 0
      + source                 = "../src/index.html"
      + storage_account_name   = "tiredanimalprodstatic"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @treilly94, Action: `pull_request`*